WELCOME = "Привет!\n\nДля просмотра раписания необходимо представиться"
GROUP_EXAMPLE = "Напишите название вашей группы\n\nНапример «ПИ18-1»"
TEACHER_EXAMPLE = "Напишите ваше ФИО\n\nНапример «Коротеев Михаил Викторович»"
CHOOSE_MENU = "Выберите пункт из меню"
WRITE_DATE = (
    "Напишите дату, что бы получить ее расписание\n\nНапример «01.10.2019» или «01.10»"
)

WHAT_TO_SET = "Выберите в меню, что требуется настроить"
WHAT_TO_FIND = "Выберите что искать"

WRITE_GROUP = "Введите название группы"
WRITE_TEACHER = "Введите фамилию или ФИО преподавателя"

SEARCHING_FOR_TEACHER = "Ищем преподавателя"
CHOOSE_CURRENT_TEACHER = "Выберите нужного преподавателя"
TEACHER_NOT_FOUND = "Преподаватель не найден"

SEARCHING = "Поиск..."
CHOOSE_TIMEDELTA = "Выберите промежуток"
INCORRECT_DATE = "Неправильная дата"
INCORRECT_DATE_FORMAT = (
    "Не удалось добавить в рассылку расписания\nНеправильный формат даты"
)
CANT_FIND_USER = "Не удалось найти пользователя"
CANT_GET_SCHEDULE = "Не удалось получить расписание"
TIMEOUT_ERROR = "Не удалось подключиться к сервису расписаний(. Попробуйте позже"
ERROR = "Ошибка"

CANT_FIND_SCHEDULE_BY_DATE = "Не удалось найти расписание на {}"
GROUP_CHANGED_FOR = "Группа изменена на «{}»"
GROUP = "Группа «{}»"
GROUP_NOT_FOUND = (
    "Группа «{}» не существует\n\nПроверьте название группы на http://ruz.fa.ru/ruz"
)
FOUND_TEACHER = "Найденный преподаватель: {}"

TODAY = "Сегодня"
TOMORROW = "Завтра"
THIS_WEEK = "Эта неделя"
NEXT_WEEK = "Следующая неделя"
CANCEL = "Отмена"

STUDENT = "Студент"
TEACHER = "Преподаватель"

SEARCH = "Поиск"
BACK = "Назад"
BACK_I = "← Назад"
SETTINGS = "Настройки"

SHOW_GROUPS = "Группы в расписании"
SHOW_LOCATION = "Корпус в расписании"
CALENDAR_LINK = "Добавить в календарь 📲"
